data/Parm_PH_29/alpha_05/alpha_05_10071_3036/0/C
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
15600
(
(0.0459696473015551 0.9999912569191 1.9606302401165e-18)
(0.132511924311751 0.976966159443465 4.28465531445943e-18)
(0.202675470262047 0.920553807936117 2.80975834292408e-17)
(0.257416785782307 0.846700342265985 2.96882509255082e-18)
(0.305936471752424 0.768505718963588 0)
(0.352741203463249 0.689312944409038 9.22711468570567e-20)
(0.400102965220869 0.610470274697217 4.79375066315208e-18)
(0.448671985301225 0.532341985167283 -9.31122561921053e-20)
...
)
;

boundaryField
{
    bottomWall
    {
        type            calculated;
        value           nonuniform List<vector> 
120
(
(0.0459499823804353 0.998033129807464 0)
(0.132237422018293 0.975110619048878 0)
(0.202209142990215 0.918973710048538 0)
(0.256898321657016 0.845127661544943 0)
(0.305385526537934 0.766784169598056 0)
(0.35215620181092 0.687374297880345 0)
(0.399479766651235 0.608299610031202 0)
(0.448006689658627 0.529958007681489 0)
...
)
;
    }
    topWall
    {
        type            calculated;
        value           nonuniform List<vector> 
120
(
(0.0419625 3.036 0)
(0.1258875 3.036 0)
(0.2098125 3.036 0)
(0.2937375 3.036 0)
(0.3776625 3.036 0)
(0.4615875 3.036 0)
(0.5455125 3.036 0)
(0.6294375 3.036 0)
...
)
;
    }
    inlet_half0
    {
        type            cyclic;
    }
    inlet_half1
    {
        type            cyclic;
    }
    outlet_half0
    {
        type            cyclic;
    }
    outlet_half1
    {
        type            cyclic;
    }
    sideRight_half0
    {
        type            empty;
    }
    sideRight_half1
    {
        type            empty;
    }
    sideLeft_half0
    {
        type            empty;
    }
    sideLeft_half1
    {
        type            empty;
    }
}


// ************************************************************************* //
