data/Parm_PH_29/alpha_05/alpha_05_10071_3036/0/tauij_LES
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      tauij_LES;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<symmTensor>
15600
(
(0.00207697 -0.00001968 0.00000000 -0.00001639 0.00000000 0.00193855)
(-0.00011302 0.00008888 0.00000000 -0.00006388 0.00000000 -0.00012864)
(0.00015123 -0.00008675 0.00000000 0.00000382 0.00000000 0.00074685)
(0.00004677 -0.00003801 0.00000000 0.00002569 0.00000000 0.00063671)
(0.00006959 -0.00008221 0.00000000 0.00009937 0.00000000 0.00070272)
(-0.00004080 0.00000416 0.00000000 0.00013063 0.00000000 0.00042874)
(-0.00002563 0.00003891 0.00000000 -0.00006369 0.00000000 0.00050590)
(0.00002852 -0.00001051 0.00000000 -0.00001612 0.00000000 0.00039771)
...
)
;

boundaryField
{
    bottomWall
    {
        type        fixedValue;
        value       uniform (0 0 0 0 0 0);
    }
    topWall
    {
        type        fixedValue;
        value       uniform (0 0 0 0 0 0);
    }
    inlet_half0
    {
        type        cyclic;
    }
    inlet_half1
    {
        type        cyclic;
    }
    outlet_half0
    {
        type        cyclic;
    }
    outlet_half1
    {
        type        cyclic;
    }
    sideRight_half0
    {
        type        empty;
    }
    sideRight_half1
    {
        type        empty;
    }
    sideLeft_half0
    {
        type        empty;
    }
    sideLeft_half1
    {
        type        empty;
    }
}

// ************************************************************************* //
